// rpglelint: -Wucconst
dcl-c c1 
const('123');
dcl-c C2 const('123');
dcl-proc my_proc;
  dcl-c     c3 const('123');
  dcl-c C4 const('123');
end-proc;
