// rpglelint: -Wshadow
dcl-ds ds1;
  subf1 int(10);
end-ds;

dcl-ds ds2 qualified;
  subf2 int(10);
end-ds;

dcl-s subf1 int(10);
dcl-s subf2 int(10);
