dcl-s my_str varchar(16);

my_str = 'this       -
          string     -
          is         -
          to         -
          long       -
          to         -
          be         -
          stored     -
          in         -
          varchar(16)';

my_str = 'this string contains '' quotes';
my_str = 'this string' + 'is concatenated'
       + 'by multiple strings';
